app/views/books/_index.html.erb

        <td><%= book.body %></td>
        <td><p><%= link_to "#{book.post_comments.count} コメント", book_path(book.id) %></p></td>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]

           <%= link_to book_favorites_path(book), method: :delete do %>
           <%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

           <%= link_to book_favorites_path(book), method: :post do %>
           <%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]