app/views/books/show.html.erb

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
        <td>
        <p>コメント件数：<%= @book.post_comments.count %></p>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
           <%= link_to book_favorites_path(@book), method: :delete do %>
           <%= @book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
           <%= link_to book_favorites_path(@book), method: :post do %>
           <%= @book.favorites.count %> いいね

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
      <table>
        <% @book.post_comments.each do |post_comment| %>